_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АналогиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АналогиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШифрОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШифрАналога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппыОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппыАналога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АналогиОбъектов/Forms/ФормаСопоставления/Ext/Form/Module.bsl
&НаСервере
Процедура СоответствиеНаСервере(МассивОбъектов,МассивРесурсов,Действие="Добавить")
	
	
	Запрос=Новый Запрос( "ВЫБРАТЬ
	|	СМ_Ресурсы.Код КАК ШифрОбъекта,
	|	СМ_Ресурсы.ГруппаРесурсов КАК ИдентификаторГруппыОбъекта,
	|	СМ_Ресурсы.Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	СМ_Ресурсы.Ссылка В(&Ссылка)
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|	И НЕ СМ_Ресурсы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_Ресурсы.Код КАК ШифрАналога,
	|	СМ_Ресурсы.ГруппаРесурсов КАК ИдентификаторГруппыАналога,
	|	СМ_Ресурсы.Ссылка
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	СМ_Ресурсы.Ссылка В(&Ссылка2)
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|	И НЕ СМ_Ресурсы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ШифрОбъекта,
	|	ВТ.ИдентификаторГруппыОбъекта,
	|	ВТ2.ШифрАналога,
	|	ВТ2.ИдентификаторГруппыАналога
	|ИЗ
	|	ВТ КАК ВТ,
	|	ВТ2 КАК ВТ2
	|ГДЕ
	|	ВТ.Ссылка <> ВТ2.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка",МассивОбъектов);
	Запрос.УстановитьПараметр("Ссылка2",МассивРесурсов);
	СтрокиПроекта=Запрос.Выполнить().Выгрузить();
	
	ДатаВремя=ТекущаяДата();
	Ответственный=Пользователи.ТекущийПользователь();
	
	Если  Действие="Добавить" Тогда
		Для Каждого Эл Из   СтрокиПроекта Цикл
			Запись=РегистрыСведений.СМ_АналогиОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,Эл);
			Запись.Дата=ДатаВремя;
			Запись.Ответственный=Ответственный;
			Запись.Записать();
		КонецЦикла;	
	Иначе
		Для Каждого Эл Из   СтрокиПроекта Цикл
			Запись=РегистрыСведений.СМ_АналогиОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,Эл);
			Запись.Прочитать();
			Запись.Удалить();
			Запись=РегистрыСведений.СМ_АналогиОбъектов.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторГруппыАналога=Эл.ИдентификаторГруппыОбъекта;
			Запись.ИдентификаторГруппыОбъекта=Эл.ИдентификаторГруппыАналога;
			Запись.ШифрАналога=Эл.ШифрОбъекта;
			Запись.ШифрОбъекта=Эл.ШифрАналога;
			Запись.Прочитать();
			Запись.Удалить();
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СоответствиеНаСервереПоКоду(МассивОбъектов,МассивРесурсов)
	
	
	Запрос=Новый Запрос( "ВЫБРАТЬ
	|	СМ_Ресурсы.Код КАК ШифрОбъекта,
	|	СМ_Ресурсы.ГруппаРесурсов КАК ИдентификаторГруппыОбъекта,
	|	СМ_Ресурсы.Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	СМ_Ресурсы.Ссылка В(&Ссылка)
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|	И НЕ СМ_Ресурсы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_Ресурсы.Код КАК ШифрАналога,
	|	СМ_Ресурсы.ГруппаРесурсов КАК ИдентификаторГруппыАналога,
	|	СМ_Ресурсы.Ссылка
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	СМ_Ресурсы.Ссылка В(&Ссылка2)
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|	И НЕ СМ_Ресурсы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ШифрОбъекта,
	|	ВТ.ИдентификаторГруппыОбъекта,
	|	ВТ2.ШифрАналога,
	|	ВТ2.ИдентификаторГруппыАналога
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	|		ПО ВТ.ШифрОбъекта = ВТ2.ШифрАналога
	|ГДЕ
	|	ВТ.Ссылка <> ВТ2.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка",МассивОбъектов);
	Запрос.УстановитьПараметр("Ссылка2",МассивРесурсов);
	СтрокиПроекта=Запрос.Выполнить().Выгрузить();
	
	ДатаВремя=ТекущаяДата();
	Ответственный=Пользователи.ТекущийПользователь();
	
	Для Каждого Эл Из   СтрокиПроекта Цикл
		Запись=РегистрыСведений.СМ_АналогиОбъектов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,Эл);
		Запись.Дата=ДатаВремя;
		Запись.Ответственный=Ответственный;
		Запись.Записать();
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСоответствие(Команда)
	Если Элементы.Ресурсы.ТекущаяСтрока<>Неопределено и Элементы.Ресурсы1.ТекущаяСтрока<>Неопределено Тогда
		МассивОбъектов=Новый Массив;
		МассивРесурсов=Новый Массив;
		Для Каждого Эл Из   Элементы.Ресурсы.ВыделенныеСтроки Цикл
			МассивОбъектов.Добавить(Эл);
		КонецЦикла;
		Для Каждого Эл Из   Элементы.Ресурсы1.ВыделенныеСтроки Цикл
			МассивРесурсов.Добавить(Эл);
		КонецЦикла;		
		СоответствиеНаСервере(МассивОбъектов,МассивРесурсов,"Добавить");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выделите элементы в разных частях таблицы");
	КонецЕсли;
	СписокОбъектовПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствие(Команда)
	Если Элементы.Ресурсы.ТекущаяСтрока<>Неопределено и Элементы.Ресурсы1.ТекущаяСтрока<>Неопределено Тогда
		МассивОбъектов=Новый Массив;
		МассивРесурсов=Новый Массив;
		Для Каждого Эл Из   Элементы.Ресурсы.ВыделенныеСтроки Цикл
			МассивОбъектов.Добавить(Эл);
		КонецЦикла;
		Для Каждого Эл Из   Элементы.Ресурсы1.ВыделенныеСтроки Цикл
			МассивРесурсов.Добавить(Эл);
		КонецЦикла;		
		СоответствиеНаСервере(МассивОбъектов,МассивРесурсов,"Удалить");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выделите элементы в разных частях таблицы");
	КонецЕсли;
	СписокОбъектовПриАктивизацииСтроки(Неопределено);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьВсеПоКоду(Команда)
	Если Элементы.Ресурсы.ТекущаяСтрока<>Неопределено и Элементы.Ресурсы1.ТекущаяСтрока<>Неопределено Тогда
		МассивОбъектов=Новый Массив;
		МассивРесурсов=Новый Массив;
		Для Каждого Эл Из   Элементы.Ресурсы.ВыделенныеСтроки Цикл
			МассивОбъектов.Добавить(Эл);
		КонецЦикла;
		Для Каждого Эл Из   Элементы.Ресурсы1.ВыделенныеСтроки Цикл
			МассивРесурсов.Добавить(Эл);
		КонецЦикла;		
		СоответствиеНаСервереПоКоду(МассивОбъектов,МассивРесурсов);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выделите элементы в разных частях таблицы");
	КонецЕсли;
	СписокОбъектовПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	УстановитьОтборКаталог();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборКаталог()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Ресурсы, "ГруппаРесурсов", Каталог,,,ЗначениеЗаполнено(Каталог));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"НеЗаполнено",не ЗначениеЗаполнено(Каталог));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"Группа",Каталог);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборКаталог1()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Ресурсы1, "ГруппаРесурсов", Каталог1,,,ЗначениеЗаполнено(Каталог1));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы,"НеЗаполнено",не ЗначениеЗаполнено(Каталог1));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы,"Группа",Каталог1);
КонецПроцедуры

&НаКлиенте
Процедура Каталог1ПриИзменении(Элемент)
	УстановитьОтборКаталог1();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"Ссылка",Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"НеЗаполнено",Истина);
		
	
	Если Параметры.Свойство("Ссылка") Тогда
		Если ТипЗнч(Параметры.Ссылка)=Тип("СправочникСсылка.СМ_ГруппыРесурсов") Тогда
			Каталог=Параметры.Ссылка;
			УстановитьОтборКаталог();
		Иначе
			Каталог=Параметры.Ссылка.ГруппаРесурсов;
			УстановитьОтборКаталог();
			Элементы.Ресурсы.ТекущаяСтрока=Параметры.Ссылка;
			
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"НеЗаполнено",не ЗначениеЗаполнено(Каталог));
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"Группа",Каталог);
		
	КонецЕсли;
	
	УстановитьОтборКаталог1();
	
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УстановитьОтборКаталог1();
КонецПроцедуры


&НаСервере
Процедура ПоказатьАналогиВКаталогеНаСервере(Ресурс,Действие="Отбор")
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Ресурсы1,"Ссылка",Ресурс);
	
	Если Действие="Отбор" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Ресурсы1, "Аналог", Истина,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ПоказатьАналогиВКаталоге(Команда)
	Элементы.СписокОбъектовПоказатьАналогиВКаталоге.Пометка=Не Элементы.СписокОбъектовПоказатьАналогиВКаталоге.Пометка;
	Если Элементы.СписокОбъектовПоказатьАналогиВКаталоге.Пометка Тогда
		Если Элементы.Ресурсы.ТекущаяСтрока<>Неопределено Тогда
			ТекущийРесурс=Элементы.Ресурсы1.ТекущаяСтрока;
			ПоказатьАналогиВКаталогеНаСервере(Элементы.Ресурсы.ТекущаяСтрока,"Отбор");
		КонецЕсли;
	Иначе
		ТекущаяСтрокаРесурса=Элементы.Ресурсы1.ТекущаяСтрока;
		ОтменитьФильтрСоответствияНаСервере();
		Если ТекущаяСтрокаРесурса=Неопределено Тогда
			Элементы.Ресурсы1.ТекущаяСтрока=ТекущийРесурс;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОтменитьФильтрСоответствияНаСервере()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы1, "Аналог", ,,,Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СписокОбъектовПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокОбъектовПоказатьАналогиВКаталоге.Пометка Тогда
		ПоказатьАналогиВКаталогеНаСервере(Элементы.Ресурсы.ТекущаяСтрока);
	Иначе
		ПоказатьАналогиВКаталогеНаСервере(Элементы.Ресурсы.ТекущаяСтрока,"Аналоги");
	КонецЕсли;
	Элементы.Ресурсы.Обновить();
	Элементы.Ресурсы1.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСопоставленные(Команда)
	Элементы.РесурсыСкрытьСопоставленные.Пометка=Не Элементы.РесурсыСкрытьСопоставленные.Пометка;
	Элементы.РесурсыСкрытьНесопоставленные.Пометка=Ложь;
	Если Элементы.РесурсыСкрытьСопоставленные.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы, "КоличествоСопоставленных",0,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы, "КоличествоСопоставленных", ,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНесопоставленные(Команда)
	Элементы.РесурсыСкрытьНесопоставленные.Пометка=Не Элементы.РесурсыСкрытьНесопоставленные.Пометка;
	Элементы.РесурсыСкрытьСопоставленные.Пометка=Ложь;
	Если Элементы.РесурсыСкрытьНесопоставленные.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы, "КоличествоСопоставленных",0,ВидСравненияКомпоновкиДанных.Больше,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы, "КоличествоСопоставленных", ,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСопоставленные1(Команда)
	Элементы.Ресурсы1СкрытьСопоставленные1.Пометка=Не Элементы.Ресурсы1СкрытьСопоставленные1.Пометка;
	Элементы.Ресурсы1СкрытьНесопоставленные1.Пометка=Ложь;
	Если Элементы.Ресурсы1СкрытьСопоставленные1.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы1, "КоличествоСопоставленных",0,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы1, "КоличествоСопоставленных", ,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНесопоставленные1(Команда)
	Элементы.Ресурсы1СкрытьНесопоставленные1.Пометка=Не Элементы.Ресурсы1СкрытьНесопоставленные1.Пометка;
	Элементы.Ресурсы1СкрытьСопоставленные1.Пометка=Ложь;
	Если Элементы.Ресурсы1СкрытьНесопоставленные1.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы1, "КоличествоСопоставленных",0,ВидСравненияКомпоновкиДанных.Больше,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ресурсы1, "КоличествоСопоставленных", ,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРесурс(Команда)
	ОткрытьФорму("Справочник.СМ_Ресурсы.ФормаОбъекта",ПолучитьДанныеЗаполнения(Элементы.Ресурсы.ТекущаяСтрока,Элементы.Ресурсы1.ТекущаяСтрока,Каталог), ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаполнения(Образец1,Образец2,Каталог)
	
	СтруктураЗаполнения=Новый Структура;
	СтруктураЗаполнения.Вставить("ЗначениеКопирования",Образец2);
	СтруктураЗаполнения.Вставить("Родитель",Образец1.Родитель);
	СтруктураЗаполнения.Вставить("ГруппаРесурсов",?(ЗначениеЗаполнено(Каталог),Каталог,Образец1.ГруппаРесурсов));
	
	// СУДАРИКОВ - Брать не просто код, а код без последней части
	// КодОбразца=Образец1.Код+"-";
	СимволТире = СтрНайти(Образец1.Код, "-", НаправлениеПоиска.СКонца);
	КОдОбразца = Лев(Образец1.Код, СимволТире);
	Запрос=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СМ_Ресурсы.Код
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	СМ_Ресурсы.Код ПОДОБНО &Код
	|	И СМ_Ресурсы.ГруппаРесурсов = &ГруппаРесурсов");
	Запрос.УстановитьПараметр("Код",КодОбразца+"%");
	Запрос.УстановитьПараметр("ГруппаРесурсов",СтруктураЗаполнения.ГруппаРесурсов);
	
	Результат=Запрос.Выполнить().Выбрать();
	Макс=0;
	Пока Результат.Следующий() Цикл
		Кд=СтрЗаменить(Результат.Код,КодОбразца,"");
		Попытка
			КдЧисло=Число(Кд);
		Исключение
			КдЧисло=1;
		КонецПопытки;
		Если КдЧисло>Макс Тогда
			Макс=КдЧисло;
		КонецЕсли;
	КонецЦикла;
	
	
	Макс=Макс+1;	
	СтруктураЗаполнения.Вставить("Код",КодОбразца+?(Макс<10,"0"+Строка(Макс),Строка(Макс)));
	
	Возврат СтруктураЗаполнения;
КонецФункции


&НаКлиенте
Процедура Отчет(Команда)
ОткрытьФорму("Отчет.СМ_СопоставлениеРесурсов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если   ИмяСобытия="ЗаписанРесурс" Тогда
		МассивОбъектов=Новый Массив;
		МассивРесурсов=Новый Массив;
		МассивОбъектов.Добавить(Параметр);
		МассивРесурсов.Добавить(Элементы.Ресурсы1.ТекущаяСтрока);
		СоответствиеНаСервере(МассивОбъектов,МассивРесурсов,"Добавить");
	КонецЕсли;
КонецПроцедуры
